Tirta7/voc_master_data_center/esp32_mqtt_client - Copy/EXUPDATE/esp32_moc3062_singletable - Copy.ino
/*
 * ESP32 MQTT Client — MOC3062 Single Table Mode
 * VOC SYSTEM (Spot On Billiard)
 *
 * Arsitektur: 1 ESP32 per meja billiard
 * Hardware  : MOC3062 (optocoupler) → TRIAC BTA16 → Lampu 220V AC
 *
 * Topologi: WiFi MQTT langsung (tidak pakai ESP-NOW)
 * Gunakan firmware ini jika setiap meja dipasang 1 ESP32 + MOC3062 secara
 * mandiri.
 *
 * Perbedaan dari firmware PCF8575 (panel konvensional):
 *  - Tidak ada PCF8575, Wire.h, atau komunikasi I2C
 *  - 1 pin GPIO langsung kontrol MOC3062 (default GPIO4)
 *  - Pin configurable via SPIFFS (/moc_config.json) & MQTT /config/set
 *  - 1 ESP = 1 meja = 1 MAC Address = 1 relay channel
 *
 * Fitur:
 *  1. Identifikasi device via MAC Address (otomatis, tanpa konfigurasi manual)
 *  2. MQTT Topics identik dengan firmware lain (berbasis MAC)
 *  3. PIN Control MOC bisa dikonfigurasi runtime via MQTT /config/set
 *  4. State persistence via SPIFFS (tahan reboot / power restore)
 *  5. Hardware Watchdog 30 detik
 *  6. WiFi auto-reconnect (full cycle jika 30s masih putus)
 *  7. MQTT LWT (Last Will & Testament) — server tahu instant jika offline
 *  8. MQTT Keep-Alive 120s + Heartbeat 60s (publish ke /heartbeat)
 *  9. Buzzer feedback (GPIO19)
 * 10. OTA update siap (dinonaktifkan by default, aktifkan jika butuh)
 *
 * WIRING:
 *  GPIO4  (D4)  → Anoda MOC3062 (via 220Ω resistor) → TRIAC BTA16 gate → Lampu
 * 220V GPIO2  (D2)  → LED indikator WiFi (onboard biasanya) GPIO19 (D19) →
 * Buzzer aktif-high
 *
 * TOPIK MQTT:
 *  Subscribe: billiard/table/{MAC}/#
 *  Publish  : billiard/table/{MAC}/status      (telemetry, retain=true)
 *           : billiard/table/{MAC}/heartbeat   (60s ping)
 *           : billiard/table/sync              (saat boot, minta state dari
 * server)
 */

#include <ArduinoJson.h>
#include <ArduinoOTA.h>
#include <PubSubClient.h>
#include <SPIFFS.h>
#include <WiFi.h>
#include <esp_efuse.h>
#include <esp_mac.h>
#include <esp_system.h>
#include <esp_task_wdt.h>

// ─────────────────────────────────────────────────────────────
// KONFIGURASI JARINGAN & MQTT
// ─────────────────────────────────────────────────────────────
const char *ssid = "Tirtaaa";
const char *password = "4DItya79!";
const char *mqtt_server = "192.168.1.19"; // IP PC server (MQTT broker)
const int mqtt_port = 1883;

// ─────────────────────────────────────────────────────────────
// PIN HARDWARE DEFAULT
// ─────────────────────────────────────────────────────────────
#define PIN_LED_WIFI 2 // Indikator WiFi (LED onboard)
#define PIN_BUZZER 19  // Buzzer aktif-high
#define PIN_BUTTON 0   // Tombol manual (BOOT button pada devkit)

// Pin MOC3062 bisa berbeda tiap modul, dibaca dari SPIFFS
// Default = GPIO4 (D4), bisa diubah via MQTT /config/set
int mocPin = 4;

// ─────────────────────────────────────────────────────────────
// LOGIKA OUTPUT MOC3062
// ─────────────────────────────────────────────────────────────
// MOC3062 bisa dihubungkan 2 cara:
//   active-HIGH: GPIO HIGH → LED optocoupler ON → TRIAC aktif → Lampu MENYALA
//   active-LOW : GPIO LOW  → LED optocoupler ON → TRIAC aktif → Lampu MENYALA
//                (terjadi jika LED MOC dihubungkan antara VCC dan GPIO, dengan
//                 pull-up, atau jika ada inverter di rangkaian)
//
// Set true  → active-LOW  (GPIO LOW  = Lampu ON)  ← rangkaian pull-up / VCC ke
// anoda Set false → active-HIGH (GPIO HIGH = Lampu ON)  ← rangkaian standar
//
// Gejala salah: software ON → lampu MATI, software OFF → lampu MENYALA
//               → ganti nilai di bawah ke 'true'
#define MOC_ACTIVE_LOW true // <-- UBAH ke false jika logika terbalik lagi

// ─────────────────────────────────────────────────────────────
// STATE & VARIABEL GLOBAL
// ─────────────────────────────────────────────────────────────
WiFiClient espClient;
PubSubClient client(espClient);

String deviceMac =
    ""; // MAC Address tanpa pemisah, uppercase (e.g. "AABBCCDDEEFF")
String baseTopic = ""; // billiard/table/{deviceMac}

bool lightState = false;   // Status lampu saat ini
bool isManualMode = false; // Flag jika dinyalakan manual via tombol
bool storageDirty = false;
unsigned long lastStateChange = 0;
unsigned long latestToken = 0; // 🛡️ SESSION LOCK (v17.2)
const unsigned long STORAGE_SAVE_DELAY =
    3000; // Tunda simpan ke SPIFFS 3s setelah perubahan

// Flag: ganti pin MOC perlu re-apply state setelah callback selesai
// (tidak dilakukan langsung di callback untuk menghindari crash)
bool pendingPinChange = false;
int pendingNewPin = -1;

// Race condition protection (tidak matikan lampu dalam window ini kecuali
// force=true)
unsigned long lightProtectedUntil = 0;

// Buzzer non-blocking
int buzzerBeepsRemaining = 0;
bool buzzerState = false;
unsigned long buzzerNextToggle = 0;
unsigned long buzzerToneDuration = 100;
unsigned long buzzerPauseDuration = 100;

// Connection tracking
bool wasWifiConnected = false;
unsigned long lastMqttRetry = 0;
unsigned long lastLedBlink = 0;
unsigned long lastStatusUpdate = 0;
unsigned long lastHeartbeat = 0;
unsigned long lastWifiCheck = 0;

const unsigned long STATUS_INTERVAL = 20000;    // Telemetry tiap 20s (Fast Sync)
uint32_t failsafeSeconds = 0;                  // 🛡️ Sisa detik bermain (Hardware Failsafe)
unsigned long lastFailsafeTick = 0;            // Tracking detik berjalan
uint8_t lastErrorCode = 0;                     // 0: OK, 16: Hardware Auto-Stop
const unsigned long HEARTBEAT_INTERVAL = 30000; // Heartbeat tiap 30s
const unsigned long WIFI_FULL_RECONNECT =
    30000; // Full reconnect jika WiFi putus >30s

// ─────────────────────────────────────────────────────────────
// FUNGSI BUZZER (Non-blocking)
// ─────────────────────────────────────────────────────────────

void startBuzzer(unsigned long durationMs) {
  buzzerBeepsRemaining = 1;
  buzzerState = true;
  buzzerToneDuration = durationMs;
  digitalWrite(PIN_BUZZER, HIGH);
  buzzerNextToggle = millis() + durationMs;
}

void startDoubleBuzzer() {
  buzzerBeepsRemaining = 3;
  buzzerState = true;
  buzzerToneDuration = 120;
  buzzerPauseDuration = 80;
  digitalWrite(PIN_BUZZER, HIGH);
  buzzerNextToggle = millis() + buzzerToneDuration;
}

void updateBuzzer() {
  if (buzzerBeepsRemaining > 0 && millis() >= buzzerNextToggle) {
    buzzerBeepsRemaining--;
    if (buzzerBeepsRemaining == 0) {
      digitalWrite(PIN_BUZZER, LOW);
      buzzerState = false;
    } else {
      buzzerState = !buzzerState;
      digitalWrite(PIN_BUZZER, buzzerState ? HIGH : LOW);
      buzzerNextToggle =
          millis() + (buzzerState ? buzzerToneDuration : buzzerPauseDuration);
    }
  }
}

