Tirta7/voc_master_data_center/esp32_mqtt_client - Copy/EXUPDATE/esp32_moc3062_singletable - Copy.ino
// ─────────────────────────────────────────────────────────────
// KONTROL LAMPU (MOC30xx via GPIO)
// ─────────────────────────────────────────────────────────────

void setLight(bool on) {
  // Pastikan mocPin sudah di-configure sebagai OUTPUT
  pinMode(mocPin, OUTPUT);

  // Terapkan logika sesuai konfigurasi wiring MOC3062
  // active-LOW : LOW = nyala, HIGH = mati
  // active-HIGH: HIGH = nyala, LOW = mati
  bool pinLevel = MOC_ACTIVE_LOW ? !on : on;
  digitalWrite(mocPin, pinLevel ? HIGH : LOW);
  lightState = on;

  Serial.printf("[MOC30xx] Pin%d → %s (Lampu %s)\n", mocPin,
                pinLevel ? "HIGH" : "LOW", on ? "MENYALA" : "MATI");
}

// ─────────────────────────────────────────────────────────────
// SPIFFS — Simpan & Muat Konfigurasi
// ─────────────────────────────────────────────────────────────

void saveConfig() {
  DynamicJsonDocument doc(256);
  doc["mocPin"] = mocPin;
  doc["lightState"] = lightState;
  doc["failsafeSeconds"] = failsafeSeconds; // Simpan sisa waktu

  File f = SPIFFS.open("/moc_config.json", FILE_WRITE);
  if (f) {
    serializeJson(doc, f);
    f.close();
    Serial.println("[SPIFFS] Config tersimpan.");
  } else {
    Serial.println("[SPIFFS] GAGAL buka file untuk tulis!");
  }
}

void loadConfig() {
  if (!SPIFFS.exists("/moc_config.json")) {
    Serial.println("[SPIFFS] Config belum ada, gunakan default.");
    return;
  }
  File f = SPIFFS.open("/moc_config.json", FILE_READ);
  if (!f) {
    Serial.println("[SPIFFS] GAGAL buka config.");
    return;
  }
  DynamicJsonDocument doc(256);
  auto err = deserializeJson(doc, f);
  f.close();
  if (err) {
    Serial.printf("[SPIFFS] Parse error: %s\n", err.c_str());
    return;
  }

  if (doc.containsKey("mocPin")) {
    int savedPin = doc["mocPin"].as<int>();
    if (savedPin >= 0 && savedPin <= 39) { // Validasi range GPIO ESP32
      mocPin = savedPin;
      Serial.printf("[SPIFFS] MOC Pin dimuat: GPIO%d\n", mocPin);
    }
  }
  if (doc.containsKey("lightState")) {
    lightState = doc["lightState"].as<bool>();
    Serial.printf("[SPIFFS] Light state dimuat: %s\n",
                  lightState ? "ON" : "OFF");
  }
  if (doc.containsKey("failsafeSeconds")) {
    failsafeSeconds = doc["failsafeSeconds"].as<uint32_t>();
    Serial.printf("[SPIFFS] Failsafe Timer dimuat: %u detik\n", failsafeSeconds);
  }
}

// ─────────────────────────────────────────────────────────────
// MQTT — Publish Status Telemetry
// ─────────────────────────────────────────────────────────────

void publishStatus() {
  if (!client.connected())
    return;

  String topic = baseTopic + "/status";
  DynamicJsonDocument doc(512);
  doc["status"] = lightState ? "ON" : "OFF";
  doc["online"] = true;
  doc["uptime"] = millis() / 1000;
  doc["rssi"] = WiFi.RSSI();
  doc["freeHeap"] = ESP.getFreeHeap();
  doc["ip"] = WiFi.localIP().toString();
  doc["mac"] = deviceMac;
  doc["lightState"] = lightState;
  doc["relayPin"] = mocPin;
  doc["mesaId"] = mocPin;     // Alias untuk identitas per meja
  doc["tableId"] = mocPin;    // Alias untuk identitas per meja
  doc["token"] = latestToken; // 🛡️ Report back current token
  doc["hwType"] = "MOC3062";
  doc["mode"] = isManualMode ? "MANUAL" : "AUTO";
  doc["errorCode"] = lastErrorCode; // 🛡️ Report if hardware just auto-stopped
  doc["remainingSeconds"] = failsafeSeconds;
  
  // Reset error code setelah dikirim agar tidak "nempel" selamanya
  if (lastErrorCode != 0) lastErrorCode = 0;

  // Kompatibilitas dengan server yang mengharapkan array "relays"
  JsonArray relays = doc.createNestedArray("relays");
  relays.add(lightState);

  char buf[512];
  serializeJson(doc, buf);
  client.publish(topic.c_str(), buf, true); // retain=true

  Serial.printf("[MQTT] ↑ Statuspublished: Light=%s, Mode=%s, RSSI=%d\n",
                lightState ? "ON" : "OFF", isManualMode ? "MANUAL" : "AUTO",
                WiFi.RSSI());
}

// ─────────────────────────────────────────────────────────────
// MQTT CALLBACK — Terima Perintah dari Server
// ─────────────────────────────────────────────────────────────

void callback(char *topic, byte *payload, unsigned int length) {
  esp_task_wdt_reset(); // Reset WDT di awal callback agar tidak timeout
  Serial.printf("[MQTT] Pesan masuk: %s (len=%u)\n", topic, length);

  // Gunakan 1024 agar cukup untuk sync_response (348 byte raw JSON)
  // ArduinoJson butuh ~2x raw size untuk internal structure
  DynamicJsonDocument doc(1024);
  DeserializationError err = deserializeJson(doc, payload, length);
  if (err) {
    Serial.printf("[MQTT] JSON parse error: %s\n", err.c_str());
    return;
  }

  String sTopic = String(topic);

  // ── 1. PING ──────────────────────────────────────────────────
  if (sTopic.endsWith("/ping")) {
    int tableId = doc["tableId"] | 0;
    DynamicJsonDocument resp(192);
    resp["tableId"] = tableId;
    resp["status"] = "PONG";
    resp["uptime"] = millis() / 1000;
    resp["rssi"] = WiFi.RSSI();
    resp["hwType"] = "MOC30xx";
    resp["mocPin"] = mocPin;

    char buf[192];
    serializeJson(resp, buf);
    client.publish((baseTopic + "/status").c_str(), buf);
    Serial.println("[MQTT] PING → PONG terkirim.");
    return;
  }

  // ── 2. SYNC RESPONSE dari Server (status awal saat boot) ─────
  if (sTopic.endsWith("/sync_response")) {
    Serial.println("[MQTT] Menerima sync response dari server...");
    JsonArray tables = doc["tables"].as<JsonArray>();

    for (JsonObject t : tables) {
      // Ambil status dari server
      const char *statusStr = t["status"] | "OFF";
      bool targetState = (strcasecmp(statusStr, "ON") == 0);

      // Debug: tampilkan nilai yang diterima dari server
      Serial.printf("[SYNC] Server kirim → status=%s targetState=%s\n",
                    statusStr, targetState ? "ON" : "OFF");

      bool pinChanged = false;

      // Jika server kirim relayPin berbeda, update mocPin
      if (t.containsKey("relayPin") && !t["relayPin"].isNull()) {
        int serverPin = t["relayPin"].as<int>();
        if (serverPin >= 0 && serverPin <= 39 && serverPin != mocPin) {
          Serial.printf(
              "[SYNC] mocPin berubah: %d → %d, wajib re-apply state\n", mocPin,
              serverPin);
          // Matikan pin lama dulu dengan benar
          bool offLevel = MOC_ACTIVE_LOW ? HIGH : LOW;
          pinMode(mocPin, OUTPUT);
          digitalWrite(mocPin, offLevel);
          // Ganti pin
          mocPin = serverPin;
          pinChanged = true;
          storageDirty = true;
          lastStateChange = millis();
        }
      }

      // Ambil sisa waktu jika ada (Hydration dari server)
      if (t.containsKey("remainingMinutes")) {
        failsafeSeconds = t["remainingMinutes"].as<uint32_t>() * 60;
        storageDirty = true;
        Serial.printf("[SYNC] Failsafe Timer diatur: %u detik\n", failsafeSeconds);
      }

