Tirta7/voc_master_data_center/esp32_mqtt_client - Copy/EXUPDATE/esp32_moc3062_singletable - Copy.ino
      // Apply state jika berbeda ATAU jika pin baru (perlu inisialisasi)
      if (lightState != targetState || pinChanged) {
        setLight(targetState);
        storageDirty = true;
        lastStateChange = millis();
        startBuzzer(400);
        Serial.printf("[SYNC] State diterapkan ke GPIO%d: %s%s\n", mocPin,
                      targetState ? "ON" : "OFF",
                      pinChanged ? " (pin baru)" : "");
      } else {
        // State sudah sama dan pin tidak berubah — konfirmasi saja
        Serial.printf("[SYNC] State sudah sesuai: %s pada GPIO%d\n",
                      lightState ? "ON" : "OFF", mocPin);
        // Re-apply ke GPIO untuk pastikan fisik benar (sanity)
        bool pinLevel = MOC_ACTIVE_LOW ? !lightState : lightState;
        digitalWrite(mocPin, pinLevel ? HIGH : LOW);
      }
      break; // 1 ESP = 1 meja, ambil entry pertama saja
    }
    return;
  }

  // ── 3. LIGHT CONTROL ─────────────────────────────────────────
  if (sTopic.endsWith("/light/set")) {
    const char *statusStr = doc["status"] | "OFF";
    bool activate = (strcasecmp(statusStr, "ON") == 0);
    bool isExtend = doc["extend"] | false;
    bool isForce = doc["force"] | false;
    latestToken = doc["token"] | 0; // 🛡️ Capture token
    int tableId = doc["tableId"] | 0;

    // Update mocPin kalau server kirim relayPin (konfigurasi baru dari server)
    if (doc.containsKey("relayPin") && !doc["relayPin"].isNull()) {
      int serverPin = doc["relayPin"].as<int>();
      if (serverPin >= 0 && serverPin <= 39 && serverPin != mocPin) {
        Serial.printf("[LIGHT] Update mocPin dari server: %d → %d\n", mocPin,
                      serverPin);
        mocPin = serverPin;
        storageDirty = true;
        lastStateChange = millis();
      }
    }

    unsigned long now = millis();

    if (!activate) {
      // MATIKAN LAMPU
      if (lightProtectedUntil > now && !isForce) {
        Serial.printf("[PROTECT] Diblokir (Race Condition, sisa %lus). Kirim "
                      "force=true untuk override.\n",
                      (lightProtectedUntil - now) / 1000);
        return;
      }
      setLight(false);
      lightProtectedUntil = 0;
      storageDirty = true;
      lastStateChange = now;
      startBuzzer(200);
      // tableId = primary key database, bukan nomor urut meja
      Serial.printf("[RELAY] DB_ID:%d MAC:%s → LAMPU MATI\n", tableId,
                    deviceMac.c_str());

    } else {
      // NYALAKAN LAMPU
      unsigned long protDuration = isExtend ? 60000 : 30000;
      lightProtectedUntil = now + protDuration;
      setLight(true);
      storageDirty = true;
      lastStateChange = now;
      if (isExtend)
        startDoubleBuzzer();
      else
        startBuzzer(500);
      Serial.printf("[RELAY] DB_ID:%d MAC:%s → LAMPU MENYALA (%s)\n", tableId,
                    deviceMac.c_str(), isExtend ? "EXTEND" : "START");
    }
    // Command dari server selalu meriset manual mode kembali ke AUTO
    isManualMode = false;
    publishStatus(); // 🚀 Kirim status segera agar backend verifikasi token
    
    // 🛡️ Update Failsafe Timer (v17.5.1)
    if (activate) {
      // Jika ada duration (Prepaid) -> Set Timer. Jika tidak ada (Open Table) -> Reset ke 0
      failsafeSeconds = (doc["duration"] | 0) * 60;
      storageDirty = true;
      if (failsafeSeconds > 0) {
        Serial.printf("[TIMER] Failsafe dimulai: %u detik\n", failsafeSeconds);
      } else {
        Serial.println("[TIMER] Mode Open Table (Tanpa Auto-Stop)");
      }
    } else {
      failsafeSeconds = 0;
      storageDirty = true;
    }

    return;
  }

  // ── 4. GPIO DIAGNOSTIC (Tes pin langsung) ────────────────────
  if (sTopic.endsWith("/gpio/set")) {
    int pin = doc["pin"] | -1;
    const char *st = doc["status"] | "OFF";
    bool state = (strcasecmp(st, "ON") == 0);

    if (pin >= 0 && pin <= 39) {
      pinMode(pin, OUTPUT);
      digitalWrite(pin, state ? HIGH : LOW);
      Serial.printf("[DIAG] GPIO%d → %s\n", pin, st);
      startBuzzer(100);
    }
    return;
  }

  // ── 5. CONFIG — Ubah mocPin runtime ──────────────────────────
  if (sTopic.endsWith("/config/set")) {
    /*
     * Payload: { "mocPin": 5 }
     * Ganti pin GPIO yang dipakai MOC3062.
     * Re-apply dilakukan di loop() via pendingPinChange flag
     * agar tidak ada blocking SPIFFS write di dalam callback.
     */
    if (doc.containsKey("mocPin")) {
      int newPin = doc["mocPin"].as<int>();
      if (newPin >= 0 && newPin <= 39) {
        if (mocPin != newPin) {
          // Matikan output pin lama dengan benar (respek active-LOW)
          bool offLevel = MOC_ACTIVE_LOW ? HIGH : LOW;
          pinMode(mocPin, OUTPUT);
          digitalWrite(mocPin, offLevel);
          Serial.printf("[CONFIG] Pin lama GPIO%d dimatikan.\n", mocPin);
        }
        // Set flag, biarkan loop() yang handle re-apply + save
        pendingNewPin = newPin;
        pendingPinChange = true;
        Serial.printf("[CONFIG] mocPin akan diganti ke GPIO%d (pending)...\n",
                      newPin);
      } else {
        Serial.printf("[CONFIG] mocPin tidak valid: %d (harus 0-39)\n", newPin);
      }
    }
    return;
  }

  // ── 6. SYSTEM COMMAND ────────────────────────────────────────
  if (sTopic.endsWith("/system/set")) {
    const char *cmd = doc["command"] | "";
    if (strcmp(cmd, "REBOOT") == 0) {
      Serial.println("[SYSTEM] Reboot via MQTT...");
      startBuzzer(1000);
      delay(1500);
      ESP.restart();
    }
    return;
  }
}

// ─────────────────────────────────────────────────────────────
// MQTT — Reconnect Handler
// ─────────────────────────────────────────────────────────────

void handleMqttConnection() {
  if (client.connected())
    return;

  if (millis() - lastMqttRetry < 8000)
    return;
  lastMqttRetry = millis();

  String clientId = "SpotOn-MOC-" + deviceMac;
  String lwtTopic = baseTopic + "/status";

  Serial.printf("[MQTT] Menghubungi broker %s:%d...\n", mqtt_server, mqtt_port);

  client.setKeepAlive(15); // 🛡️ Fast Disconnect Detection (v17.5)
  if (client.connect(clientId.c_str(), lwtTopic.c_str(), 1, true,
                     "{\"status\":\"offline\",\"hwType\":\"MOC3062\"}")) {

