Tirta7/voc_master_data_center/esp32_mqtt_client - Copy/EXUPDATE/esp32_moc3062_singletable - Copy.ino
    // LWT online
    client.publish(lwtTopic.c_str(),
                   "{\"status\":\"online\",\"hwType\":\"MOC3062\"}", true);

    // Subscribe ke semua topik milik device ini
    client.subscribe((baseTopic + "/#").c_str());

    // Minta sync state dari server
    client.publish("billiard/table/sync", deviceMac.c_str());

    Serial.printf("[MQTT] Terhubung! Subscribed: %s/#\n", baseTopic.c_str());
    Serial.println("[MQTT] Sync request dikirim ke server.");

  } else {
    int rc = client.state();
    Serial.printf("[MQTT] Gagal (rc=%d). Retry 8s lagi.\n", rc);
    if (rc == -2) {
      Serial.println(">> RC -2: Cek IP server, port 1883, Mosquitto berjalan.");
    }
  }
}

// ─────────────────────────────────────────────────────────────
// WIFI EVENT HANDLER
// ─────────────────────────────────────────────────────────────

void onWifiEvent(WiFiEvent_t event) {
  switch (event) {
  case ARDUINO_EVENT_WIFI_STA_GOT_IP:
    Serial.printf("[WiFi] Terhubung! IP: %s\n",
                  WiFi.localIP().toString().c_str());
    digitalWrite(PIN_LED_WIFI, HIGH);
    wasWifiConnected = true;
    lastMqttRetry = 0; // Langsung retry MQTT
    break;
  case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
    Serial.println("[WiFi] Terputus dari AP. Auto-reconnect...");
    digitalWrite(PIN_LED_WIFI, LOW);
    wasWifiConnected = false;
    break;
  default:
    break;
  }
}

// ─────────────────────────────────────────────────────────────
// SETUP
// ─────────────────────────────────────────────────────────────

void setup() {
  // ── PRIORITAS PERTAMA: Matikan MOC pin sebelum apapun ────────
  // Ini meminimalkan durasi blink yang terjadi saat ESP32 boot
  // (GPIO masih floating saat bootloader, pull-up hardware 10kΩ
  //  adalah solusi terbaik, ini adalah software safety net)
  pinMode(mocPin, OUTPUT);
  bool safeOffLevel = MOC_ACTIVE_LOW ? HIGH : LOW;
  digitalWrite(mocPin, safeOffLevel); // Matikan MOC3062 secepat mungkin

  Serial.begin(115200);
  Serial.println("\n\n=== BOOTING ESP32 — MOC30xx SINGLE TABLE MODE ===");
  Serial.println("VOC Billiard System | Hybrid IoT");
  Serial.println("=================================================");

  // 1. Pin dasar
  pinMode(PIN_BUZZER, OUTPUT);
  pinMode(PIN_BUTTON, INPUT_PULLUP);
  digitalWrite(PIN_LED_WIFI, LOW);
  digitalWrite(PIN_BUZZER, LOW);

  // 2. Mount SPIFFS & load config (mocPin, lightState)
  if (SPIFFS.begin(true)) {
    Serial.println("[SPIFFS] Mount berhasil.");
    loadConfig();
  } else {
    Serial.println("[SPIFFS] Mount GAGAL! Gunakan nilai default.");
  }

  // 3. Inisialisasi pin MOC3062 — RESTORE state dari SPIFFS
  //
  //  ♻ POWER RESTORE LOGIC:
  //    - Jika sebelum mati listrik lampu MENYALA → langsung nyalakan lagi
  //    - Jika sebelum mati listrik lampu MATI    → tetap mati
  //    - Server akan koreksi via sync_response jika session sudah berakhir
  //      selama pemadaman (misalnya billing habis, staff matikan manual di SW)
  //
  Serial.printf("[HARDWARE] Init MOC30xx pada GPIO%d (mode: %s)\n", mocPin,
                MOC_ACTIVE_LOW ? "ACTIVE-LOW" : "ACTIVE-HIGH");
  pinMode(mocPin, OUTPUT);

  // Terapkan state tersimpan dari SPIFFS langsung ke GPIO
  bool bootPinLevel = MOC_ACTIVE_LOW ? !lightState : lightState;
  digitalWrite(mocPin, bootPinLevel ? HIGH : LOW);

  if (lightState) {
    Serial.println(
        "[HARDWARE] ♻ POWER RESTORE: Lampu MENYALA (state dari SPIFFS)");
    Serial.println("[HARDWARE] Server akan konfirmasi/koreksi via sync...");
  } else {
    Serial.println("[HARDWARE] Lampu OFF saat boot (state dari SPIFFS).");
  }

  // 4. Watchdog 30 detik
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
  esp_task_wdt_config_t wdt_cfg = {
      .timeout_ms = 30000, .idle_core_mask = 0, .trigger_panic = true};
  esp_task_wdt_reconfigure(&wdt_cfg);
#else
  esp_task_wdt_init(30, true);
#endif
  esp_task_wdt_add(NULL);

  // 5. Baca MAC Address (untuk baseTopic & client ID)
  uint8_t baseMac[6];
  esp_efuse_mac_get_default(baseMac);
  char macStr[13];
  sprintf(macStr, "%02X%02X%02X%02X%02X%02X", baseMac[0], baseMac[1],
          baseMac[2], baseMac[3], baseMac[4], baseMac[5]);
  deviceMac = String(macStr);
  baseTopic = "billiard/table/" + deviceMac;

  Serial.printf("[DEVICE] MAC Address : %s\n", deviceMac.c_str());
  Serial.printf("[DEVICE] Base Topic  : %s\n", baseTopic.c_str());
  Serial.printf("[DEVICE] MOC Control : GPIO%d\n", mocPin);

  // 6. MQTT client setup
  client.setKeepAlive(120);
  client.setSocketTimeout(10);
  client.setBufferSize(1024);
  client.setServer(mqtt_server, mqtt_port);
  client.setCallback(callback);

  // 7. WiFi connect
  WiFi.onEvent(onWifiEvent);
  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.persistent(true);

  Serial.printf("[WiFi] Menyambung ke SSID '%s'...\n", ssid);
  WiFi.begin(ssid, password);

  int retry = 0;
  while (WiFi.status() != WL_CONNECTED && retry < 20) {
    delay(500);
    Serial.print(".");
    retry++;
  }
  Serial.println();

  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("[WiFi] Terhubung! IP: %s\n",
                  WiFi.localIP().toString().c_str());
  } else {
    Serial.println("[WiFi] GAGAL. Akan retry di loop().");
  }

  // 8. OTA (non-aktif by default, uncomment jika perlu)
  // ArduinoOTA.setHostname(("SpotOn-MOC-" + deviceMac).c_str());
  // ArduinoOTA.begin();

  // Buzzer 2x: boot sukses
  startDoubleBuzzer();

  Serial.println("\n=== MOC3062 NODE READY ===");
  Serial.printf("Daftarkan meja ini di Admin → Manajemen Meja\n");
  Serial.printf("  MAC Address : %s\n", deviceMac.c_str());
  Serial.printf("  PIN Control : %d  (GPIO%d)\n", mocPin, mocPin);
  Serial.println("=========================\n");
}

// ─────────────────────────────────────────────────────────────
// LOOP
// ─────────────────────────────────────────────────────────────

void loop() {
  esp_task_wdt_reset();
  unsigned long now = millis();

  updateBuzzer();
  // ArduinoOTA.handle(); // Uncomment jika OTA diaktifkan

  // ── Handle Push Button (Manual Override) ───────────────────
  static unsigned long lastBtnPress = 0;
  static bool lastBtnState = HIGH;
  bool currentBtnState = digitalRead(PIN_BUTTON);
  if (currentBtnState == LOW && lastBtnState == HIGH &&
      (now - lastBtnPress > 500)) {
    lastBtnPress = now;
    isManualMode = true;
    setLight(!lightState);
    storageDirty = true;
    lastStateChange = now;
    startBuzzer(150);
    Serial.printf("[HARDWARE] Tombol ditekan! Mode: MANUAL, State: %s\n",
                  lightState ? "ON" : "OFF");
    publishStatus(); // Kirim status segera agar backend tahu ini manual
  }
  lastBtnState = currentBtnState;

  if (WiFi.status() == WL_CONNECTED) {
    // MQTT reconnect & loop
    handleMqttConnection();
    client.loop();

    // ── Telemetry tiap 30s ───────────────────────────────────
    if (client.connected() && (now - lastStatusUpdate > STATUS_INTERVAL)) {
      lastStatusUpdate = now;
      publishStatus();
    }

    // ── Heartbeat tiap 60s ───────────────────────────────────
    // Publish ringan ke /heartbeat agar broker tidak drop koneksi saat idle
    if (client.connected() && (now - lastHeartbeat > HEARTBEAT_INTERVAL)) {
      lastHeartbeat = now;
      String htopic = baseTopic + "/heartbeat";
      String hpayload = "{\"uptime\":" + String(millis() / 1000) +
                        ",\"rssi\":" + String(WiFi.RSSI()) +
                        ",\"hwType\":\"MOC3062\"" +
                        ",\"mesaId\":" + String(mocPin) + ",\"mode\":\"" +
                        (isManualMode ? "MANUAL" : "AUTO") + "\"}";
      client.publish(htopic.c_str(), hpayload.c_str());
      Serial.println("[MQTT] Heartbeat terkirim.");
    }

  } else {
    // WiFi terputus: LED blink & full reconnect cycle
    if (now - lastLedBlink > 300) {
      lastLedBlink = now;
      digitalWrite(PIN_LED_WIFI, !digitalRead(PIN_LED_WIFI));
    }
    if (now - lastWifiCheck > WIFI_FULL_RECONNECT) {
      lastWifiCheck = now;
      Serial.println("[WiFi] Belum tersambung, coba full reconnect...");
      WiFi.disconnect(true);
      delay(500);
      WiFi.begin(ssid, password);
    }
  }

  // ── 🛡️ FAILS-SAFE HARDWARE TIMER (v17.5) ──────────────────
  if (lightState && failsafeSeconds > 0) {
    if (now - lastFailsafeTick >= 1000) {
      lastFailsafeTick = now;
      failsafeSeconds--;

