Tirta7/voc_master_data_center/esp32_mqtt_client - Copy/EXUPDATE/esp32_moc3062_singletable - Copy.ino
      // Update storage setiap 30 detik agar tidak boros flash
      if (failsafeSeconds % 30 == 0) storageDirty = true;

      if (failsafeSeconds == 0) {
        Serial.println("[TIMER] ⏰ Failsafe Triggered! Mematikan lampu mandiri...");
        setLight(false);
        lastErrorCode = 16;  // Code for 'Safe Stop'
        storageDirty = true;
        lastStateChange = now;
        startBuzzer(1000);   // Buzzer panjang tanda waktu habis
        publishStatus();     // Segera lapor ke server
      }
    }
  } else if (!lightState) {
    failsafeSeconds = 0;
  }

  // ── Deferred SPIFFS Save (3s setelah perubahan terakhir) ──
  if (storageDirty && (now - lastStateChange > STORAGE_SAVE_DELAY)) {
    saveConfig();
    storageDirty = false;
  }

  // ── Pending Pin Change (dari /config/set MQTT command) ──────
  // Dilakukan di loop() bukan di callback agar tidak blocking
  if (pendingPinChange && pendingNewPin >= 0) {
    pendingPinChange = false;
    mocPin = pendingNewPin;
    pendingNewPin = -1;
    setLight(lightState); // Re-apply state di pin baru
    storageDirty = true;
    lastStateChange = millis();
    startBuzzer(300);
    Serial.printf("[CONFIG] mocPin resmi diubah ke GPIO%d\n", mocPin);
    publishStatus();
  }

  // ── Sanity Check: Pastikan pin GPIO sesuai state ──────────
  // Koreksi output pin tiap 10 detik jika ada glitch
  static unsigned long lastPinVerify = 0;
  if (now - lastPinVerify > 10000) {
    lastPinVerify = now;
    int currentPinState = digitalRead(mocPin);
    // Hitung expected pin level sesuai logika active-LOW/HIGH
    bool expectedLevel = MOC_ACTIVE_LOW ? !lightState : lightState;
    bool pinIsHigh = (currentPinState == HIGH);
    if (pinIsHigh != expectedLevel) {
      Serial.printf("[FIX] Pin GPIO%d tidak sesuai state, koreksi...\n",
                    mocPin);
      digitalWrite(mocPin, expectedLevel ? HIGH : LOW);
    }
  }
}
